In [1]:
%load_ext sql
%sql duckdb://

There's a new jupysql version available (0.10.2), you're running 0.10.0. To upgrade: pip install jupysql --upgrade

# SELECT, INSERT, UPDATE, DELETE
Summary:
This code snippet demonstrates the basic SQL statements: SELECT, INSERT, UPDATE, and DELETE. It starts by creating a table called "employees" with columns for id, name, age, and salary. Then, it inserts some sample data into the table. 

The SELECT statement is used to retrieve data from the table. It shows examples of selecting all rows and specific columns, as well as filtering rows based on a condition using the WHERE clause.

The UPDATE statement is used to modify the data in a specific row. In this case, it updates the salary of an employee with id 2.

The DELETE statement is used to remove a row from the table. In this case, it deletes the employee with id 1.

Finally, the SELECT statement is used again to show the remaining rows in the table after the update and delete operations.

These basic SQL statements are fundamental for interacting with databases and manipulating data.

## Creating Table with Data

In [2]:
%%sql

CREATE TABLE employees (
    id INT PRIMARY KEY,
    name VARCHAR(100),
    age INT,
    salary DECIMAL(10, 2)
);

INSERT INTO employees (id, name, age, salary)
VALUES (1, 'John Doe', 30, 50000.00),
       (2, 'Jane Smith', 25, 60000.00),
       (3, 'Mike Johnson', 35, 70000.00);

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

## All Columns

In [3]:
%%sql

SELECT * FROM employees;

Running query in 'duckdb://'

+----+--------------+-----+----------+
| id |     name     | age |  salary  |
+----+--------------+-----+----------+
| 1  |   John Doe   |  30 | 50000.00 |
| 2  |  Jane Smith  |  25 | 60000.00 |
| 3  | Mike Johnson |  35 | 70000.00 |
+----+--------------+-----+----------+

## Specific Columns

In [5]:
%%sql

SELECT name, age FROM employees;

Running query in 'duckdb://'

+--------------+-----+
|     name     | age |
+--------------+-----+
|   John Doe   |  30 |
|  Jane Smith  |  25 |
| Mike Johnson |  35 |
+--------------+-----+

## Condition

In [7]:
%%sql

SELECT * FROM employees WHERE age > 30;

Running query in 'duckdb://'

+----+--------------+-----+----------+
| id |     name     | age |  salary  |
+----+--------------+-----+----------+
| 3  | Mike Johnson |  35 | 70000.00 |
+----+--------------+-----+----------+

## Update and Delete

In [9]:
%%sql

UPDATE employees SET salary = 75000.00 WHERE id = 2;

DELETE FROM employees WHERE id = 1;

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

In [10]:
%%sql

SELECT * FROM employees;

Running query in 'duckdb://'

+----+--------------+-----+----------+
| id |     name     | age |  salary  |
+----+--------------+-----+----------+
| 2  |  Jane Smith  |  25 | 75000.00 |
| 3  | Mike Johnson |  35 | 70000.00 |
+----+--------------+-----+----------+

# WHERE clause and Filter Conditions

This code snippet demonstrates the usage of the `WHERE` clause and filter conditions in SQL. The `WHERE` clause is used to filter rows based on specified conditions. Here are the different examples covered:

1. Selecting all employees: This query retrieves all rows from the `employees` table.
2. Selecting employees with age greater than 30: This query filters the rows where the `age` column is greater than 30.
3. Selecting employees with salary between 5500 and 6500: This query filters the rows where the `salary` column is between 5500 and 6500.
4. Selecting employees with names starting with 'J': This query filters the rows where the `name` column starts with 'J'.
5. Selecting employees with names ending with 'n': This query filters the rows where the `name` column ends with 'n'.
6. Selecting employees with names containing 'mi': This query filters the rows where the `name` column contains 'mi'.
7. Selecting employees with age less than or equal to 30 and salary greater than 5500: This query filters the rows where the `age` column is less than or equal to 30 and the `salary` column is greater than 5500.
8. Selecting employees with age greater than 30 or salary less than 5500: This query filters the rows where the `age` column is greater than 30 or the `salary` column is less than 5500.
9. Selecting employees with age not equal to 30: This query filters the rows where the `age` column is not equal to 30.
10. Selecting employees with NULL salary: This query filters the rows where the `salary` column is NULL.
11. Selecting employees with non-NULL salary: This query filters the rows where the `salary` column is not NULL.
12. Selecting employees with age greater than 30 and salary greater than 6000, ordered by salary in descending order: This query filters the rows where the `age` column is greater than 30 and the `salary` column is greater than 6000, and then orders the result by the `salary` column in descending order.
13. Selecting the maximum salary from employees: This query retrieves the maximum value from the `salary` column.
14. Selecting the minimum salary from employees: This query retrieves the minimum value from the `salary` column.
15. Selecting the average salary from employees: This query calculates the average value of the `salary` column.
16. Selecting the total salary from employees: This query calculates the sum of the `salary` column.
17. Selecting the number of employees: This query counts the number of rows in the `employees` table.
18. Deleting employees with age less than 30: This query deletes rows from the `employees` table where the `age` column is less than 30.
19. Updating salary of employees with age greater than 30: This query updates the `salary` column of rows in the `employees` table where the `age` column is greater than 30 by adding 1000 to the existing salary.

In [11]:
%%sql

CREATE TABLE employees2 (
    id INT PRIMARY KEY,
    name VARCHAR(100),
    age INT,
    salary DECIMAL(10, 2)
);

INSERT INTO employees2 (id, name, age, salary)
VALUES (1, 'John Doe', 30, 5000),
       (2, 'Jane Smith', 25, 6000),
       (3, 'Mike Johnson', 35, 7000),
       (4, 'Emily Davis', 28, 5500),
       (5, 'David Brown', 32, 6500);

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

In [15]:
%sql SELECT * FROM employees2;

Running query in 'duckdb://'

+----+--------------+-----+---------+
| id |     name     | age |  salary |
+----+--------------+-----+---------+
| 1  |   John Doe   |  30 | 5000.00 |
| 2  |  Jane Smith  |  25 | 6000.00 |
| 3  | Mike Johnson |  35 | 7000.00 |
| 4  | Emily Davis  |  28 | 5500.00 |
| 5  | David Brown  |  32 | 6500.00 |
+----+--------------+-----+---------+

In [16]:
%sql SELECT * FROM employees2 WHERE age > 30;

Running query in 'duckdb://'

+----+--------------+-----+---------+
| id |     name     | age |  salary |
+----+--------------+-----+---------+
| 3  | Mike Johnson |  35 | 7000.00 |
| 5  | David Brown  |  32 | 6500.00 |
+----+--------------+-----+---------+

In [17]:
%sql SELECT * FROM employees2 WHERE salary BETWEEN 5500 AND 6500;

Running query in 'duckdb://'

+----+-------------+-----+---------+
| id |     name    | age |  salary |
+----+-------------+-----+---------+
| 2  |  Jane Smith |  25 | 6000.00 |
| 4  | Emily Davis |  28 | 5500.00 |
| 5  | David Brown |  32 | 6500.00 |
+----+-------------+-----+---------+

In [18]:
%sql SELECT * FROM employees2 WHERE name LIKE 'J%';

Running query in 'duckdb://'

+----+------------+-----+---------+
| id |    name    | age |  salary |
+----+------------+-----+---------+
| 1  |  John Doe  |  30 | 5000.00 |
| 2  | Jane Smith |  25 | 6000.00 |
+----+------------+-----+---------+

In [19]:
%sql SELECT * FROM employees2 WHERE name LIKE '%n';

Running query in 'duckdb://'

+----+--------------+-----+---------+
| id |     name     | age |  salary |
+----+--------------+-----+---------+
| 3  | Mike Johnson |  35 | 7000.00 |
| 5  | David Brown  |  32 | 6500.00 |
+----+--------------+-----+---------+

In [20]:
%sql SELECT * FROM employees2 WHERE name LIKE '%mi%';

Running query in 'duckdb://'

+----+-------------+-----+---------+
| id |     name    | age |  salary |
+----+-------------+-----+---------+
| 2  |  Jane Smith |  25 | 6000.00 |
| 4  | Emily Davis |  28 | 5500.00 |
+----+-------------+-----+---------+

In [21]:
%sql SELECT * FROM employees2 WHERE age <= 30 AND salary > 5500;

Running query in 'duckdb://'

+----+------------+-----+---------+
| id |    name    | age |  salary |
+----+------------+-----+---------+
| 2  | Jane Smith |  25 | 6000.00 |
+----+------------+-----+---------+

In [22]:
%sql SELECT * FROM employees2 WHERE age > 30 OR salary < 5500;

Running query in 'duckdb://'

+----+--------------+-----+---------+
| id |     name     | age |  salary |
+----+--------------+-----+---------+
| 3  | Mike Johnson |  35 | 7000.00 |
| 5  | David Brown  |  32 | 6500.00 |
| 1  |   John Doe   |  30 | 5000.00 |
+----+--------------+-----+---------+

In [23]:
%sql SELECT * FROM employees2 WHERE age <> 30;

Running query in 'duckdb://'

+----+--------------+-----+---------+
| id |     name     | age |  salary |
+----+--------------+-----+---------+
| 2  |  Jane Smith  |  25 | 6000.00 |
| 3  | Mike Johnson |  35 | 7000.00 |
| 4  | Emily Davis  |  28 | 5500.00 |
| 5  | David Brown  |  32 | 6500.00 |
+----+--------------+-----+---------+

In [24]:
%sql SELECT * FROM employees2 WHERE salary IS NULL;

Running query in 'duckdb://'

+----+------+-----+--------+
| id | name | age | salary |
+----+------+-----+--------+
+----+------+-----+--------+

In [25]:
%sql SELECT * FROM employees2 WHERE salary IS NOT NULL;

Running query in 'duckdb://'

+----+--------------+-----+---------+
| id |     name     | age |  salary |
+----+--------------+-----+---------+
| 1  |   John Doe   |  30 | 5000.00 |
| 2  |  Jane Smith  |  25 | 6000.00 |
| 3  | Mike Johnson |  35 | 7000.00 |
| 4  | Emily Davis  |  28 | 5500.00 |
| 5  | David Brown  |  32 | 6500.00 |
+----+--------------+-----+---------+

In [26]:
%sql SELECT * FROM employees2 WHERE age > 30 AND salary > 6000 ORDER BY salary DESC;

Running query in 'duckdb://'

+----+--------------+-----+---------+
| id |     name     | age |  salary |
+----+--------------+-----+---------+
| 3  | Mike Johnson |  35 | 7000.00 |
| 5  | David Brown  |  32 | 6500.00 |
+----+--------------+-----+---------+

In [27]:
%sql SELECT MAX(salary) FROM employees2;

Running query in 'duckdb://'

+-------------+
| max(salary) |
+-------------+
|   7000.00   |
+-------------+

In [28]:
%sql SELECT MIN(salary) FROM employees2;

Running query in 'duckdb://'

+-------------+
| min(salary) |
+-------------+
|   5000.00   |
+-------------+

In [29]:
%sql SELECT AVG(salary) FROM employees2;

Running query in 'duckdb://'

+-------------+
| avg(salary) |
+-------------+
|    6000.0   |
+-------------+

In [30]:
%sql SELECT SUM(salary) FROM employees2;

Running query in 'duckdb://'

+-------------+
| sum(salary) |
+-------------+
|   30000.00  |
+-------------+

In [31]:
%sql SELECT COUNT(*) FROM employees2;

Running query in 'duckdb://'

+--------------+
| count_star() |
+--------------+
|      5       |
+--------------+

In [32]:
%sql DELETE FROM employees2 WHERE age < 30;

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

In [33]:
%sql SELECT * FROM employees2;

Running query in 'duckdb://'

+----+--------------+-----+---------+
| id |     name     | age |  salary |
+----+--------------+-----+---------+
| 1  |   John Doe   |  30 | 5000.00 |
| 3  | Mike Johnson |  35 | 7000.00 |
| 5  | David Brown  |  32 | 6500.00 |
+----+--------------+-----+---------+

In [34]:
%sql UPDATE employees2 SET salary = salary + 1000 WHERE age > 30;

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

In [35]:
%sql SELECT * FROM employees2;

Running query in 'duckdb://'

+----+--------------+-----+---------+
| id |     name     | age |  salary |
+----+--------------+-----+---------+
| 1  |   John Doe   |  30 | 5000.00 |
| 3  | Mike Johnson |  35 | 8000.00 |
| 5  | David Brown  |  32 | 7500.00 |
+----+--------------+-----+---------+

# Operators (e.g., =, <>, >, <, etc.)

This code snippet demonstrates the usage of operators in SQL statements. The `=` operator is used for exact matches, `<>` for inequality, `>`, `<`, `<=`, and `>=` for comparison, and `LIKE` for pattern matching. The code creates a table called "employees" and inserts some sample data. Then, various SELECT statements are used to retrieve specific rows based on different conditions using the operators. The expected output is also provided for each SELECT statement.

In [37]:
%%sql

CREATE TABLE employees3 (
    id INT PRIMARY KEY,
    name VARCHAR(50),
    age INT,
    salary DECIMAL(10, 2)
);

INSERT INTO employees3 (id, name, age, salary)
VALUES (1, 'John Doe', 30, 50000),
       (2, 'Jane Smith', 25, 60000),
       (3, 'Mike Johnson', 35, 70000),
       (4, 'Emily Davis', 28, 55000);

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

In [47]:
%sql SELECT * FROM employees3;

Running query in 'duckdb://'

+----+--------------+-----+----------+
| id |     name     | age |  salary  |
+----+--------------+-----+----------+
| 1  |   John Doe   |  30 | 50000.00 |
| 2  |  Jane Smith  |  25 | 60000.00 |
| 3  | Mike Johnson |  35 | 70000.00 |
| 4  | Emily Davis  |  28 | 55000.00 |
+----+--------------+-----+----------+

In [39]:
%sql SELECT * FROM employees3 WHERE age > 30;

Running query in 'duckdb://'

+----+--------------+-----+----------+
| id |     name     | age |  salary  |
+----+--------------+-----+----------+
| 3  | Mike Johnson |  35 | 70000.00 |
+----+--------------+-----+----------+

In [40]:
%sql SELECT * FROM employees3 WHERE salary <= 55000;

Running query in 'duckdb://'

+----+-------------+-----+----------+
| id |     name    | age |  salary  |
+----+-------------+-----+----------+
| 1  |   John Doe  |  30 | 50000.00 |
| 4  | Emily Davis |  28 | 55000.00 |
+----+-------------+-----+----------+

In [41]:
%sql SELECT * FROM employees3 WHERE name <> 'John Doe';

Running query in 'duckdb://'

+----+--------------+-----+----------+
| id |     name     | age |  salary  |
+----+--------------+-----+----------+
| 2  |  Jane Smith  |  25 | 60000.00 |
| 3  | Mike Johnson |  35 | 70000.00 |
| 4  | Emily Davis  |  28 | 55000.00 |
+----+--------------+-----+----------+

In [42]:
%sql SELECT * FROM employees3 WHERE age BETWEEN 25 AND 30;

Running query in 'duckdb://'

+----+-------------+-----+----------+
| id |     name    | age |  salary  |
+----+-------------+-----+----------+
| 1  |   John Doe  |  30 | 50000.00 |
| 2  |  Jane Smith |  25 | 60000.00 |
| 4  | Emily Davis |  28 | 55000.00 |
+----+-------------+-----+----------+

In [43]:
%sql SELECT * FROM employees3 WHERE salary NOT BETWEEN 55000 AND 70000;

Running query in 'duckdb://'

+----+----------+-----+----------+
| id |   name   | age |  salary  |
+----+----------+-----+----------+
| 1  | John Doe |  30 | 50000.00 |
+----+----------+-----+----------+

In [44]:
%sql SELECT * FROM employees3 WHERE name LIKE 'J%';

Running query in 'duckdb://'

+----+------------+-----+----------+
| id |    name    | age |  salary  |
+----+------------+-----+----------+
| 1  |  John Doe  |  30 | 50000.00 |
| 2  | Jane Smith |  25 | 60000.00 |
+----+------------+-----+----------+

In [45]:
%sql SELECT * FROM employees3 WHERE name LIKE '%son';

Running query in 'duckdb://'

+----+--------------+-----+----------+
| id |     name     | age |  salary  |
+----+--------------+-----+----------+
| 3  | Mike Johnson |  35 | 70000.00 |
+----+--------------+-----+----------+

In [46]:
%sql SELECT * FROM employees3 WHERE name LIKE '%mi%';

Running query in 'duckdb://'

+----+-------------+-----+----------+
| id |     name    | age |  salary  |
+----+-------------+-----+----------+
| 2  |  Jane Smith |  25 | 60000.00 |
| 4  | Emily Davis |  28 | 55000.00 |
+----+-------------+-----+----------+

# Aggregate Functions (e.g., COUNT, SUM, AVG)

In this code snippet, we demonstrate the usage of aggregate functions in SQL, specifically the COUNT, SUM, and AVG functions.

First, we create a table called "employees" to store employee information. We then insert sample data into the table.

To count the number of employees, we use the COUNT(*) function, which counts all rows in the table. The result is aliased as "total_employees".

To calculate the sum of all employee salaries, we use the SUM(salary) function, which adds up the values in the "salary" column. The result is aliased as "total_salary".

To calculate the average age of employees, we use the AVG(age) function, which calculates the average of the values in the "age" column. The result is aliased as "average_age".

We can also use aggregate functions in combination with other clauses. In the next example, we count the number of employees with a salary greater than 50000. We use the WHERE clause to filter the rows based on the salary condition.

Lastly, we calculate the sum of salaries for employees aged 30 or younger. We use the WHERE clause to filter the rows based on the age condition.

Each query is executed and the expected output is mentioned in the comments after the print statements.

In [48]:
%%sql

CREATE TABLE employees4 (
    id INT PRIMARY KEY,
    name VARCHAR(50),
    age INT,
    salary DECIMAL(10, 2)
);

INSERT INTO employees4 (id, name, age, salary)
VALUES (1, 'John Doe', 30, 50000),
       (2, 'Jane Smith', 35, 60000),
       (3, 'Mike Johnson', 40, 70000),
       (4, 'Emily Davis', 25, 45000),
       (5, 'David Brown', 45, 80000);

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

In [49]:
%sql SELECT COUNT(*) AS total_employees FROM employees4;

Running query in 'duckdb://'

+-----------------+
| total_employees |
+-----------------+
|        5        |
+-----------------+

In [50]:
%sql SELECT SUM(salary) AS total_salary FROM employees4;

Running query in 'duckdb://'

+--------------+
| total_salary |
+--------------+
|  305000.00   |
+--------------+

In [51]:
%sql SELECT AVG(age) AS average_age FROM employees4;

Running query in 'duckdb://'

+-------------+
| average_age |
+-------------+
|     35.0    |
+-------------+

In [53]:
%%sql

SELECT COUNT(*) AS high_salary_employees
FROM employees4
WHERE salary > 50000;

Running query in 'duckdb://'

+-----------------------+
| high_salary_employees |
+-----------------------+
|           3           |
+-----------------------+

In [54]:
%%sql

SELECT SUM(salary) AS total_salary_young_employees
FROM employees4
WHERE age <= 30;

Running query in 'duckdb://'

+------------------------------+
| total_salary_young_employees |
+------------------------------+
|           95000.00           |
+------------------------------+

# COUNT()

Although `COUNT(*)` as the one shown the most in these snippets, COUNT() can also take other args such as a column name to get # of non-null values of that column (and other variants like using DISTINCT).

# Aggregate on Whole Result Set

If you apply an aggreage like `COUNT` to a whole result set (no `GROUPING` clause), then you'll get back 1 result with that aggregate applied (renamed or not depending on whether you use `AS`).

If you try to get any __other columns__ (not in aggregate), that will be an __error__.

`COUNT(name)` will get the # of non-null names.

`COUNT(DISTINCT name)` will dedupe (case sensitive).

You can do math on these values in the final result as shown here.

In [15]:
%%sql

CREATE OR REPLACE TABLE employees5 (
    id INT PRIMARY KEY,
    name VARCHAR(50) NULL,
    age INT,
    salary DECIMAL(10, 2)
);

INSERT INTO employees5 (id, name, age, salary)
VALUES (1, 'John Doe', 30, 50000),
       (2, 'Jane Smith', 35, 60000),
       (3, 'Mike Johnson', 40, 70000),
       (4, 'Emily Davis', 25, 45000),
       (5, 'David Brown', 45, 80000),
        (6, NULL, 50, 90000),
        (7, 'David Brown', 100, 100);

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

In [16]:
%sql SELECT COUNT(name) FROM employees5;

Running query in 'duckdb://'

+---------------+
| count("name") |
+---------------+
|       6       |
+---------------+

In [17]:
%sql SELECT COUNT(DISTINCT name) FROM employees5;

Running query in 'duckdb://'

+------------------------+
| count(DISTINCT "name") |
+------------------------+
|           5            |
+------------------------+

In [19]:
%sql SELECT COUNT(name) - COUNT(DISTINCT name) AS diff FROM employees5;

Running query in 'duckdb://'

+------+
| diff |
+------+
|  1   |
+------+